test/fixtures/refund_payment.json

HTTP/1.1 201 Created
Server: Apache-Coyote/1.1
Set-Cookie: rememberMe=deleteMe; Path=/acceptor; Max-Age=0; Expires=Mon, 15-Mar-2015 11:52:31 GMT
Content-Type: application/json;charset=UTF-8
Transfer-Encoding: chunked
Date: Tue, 16 Mar 2015 11:52:32 GMT

{"processing":{"authResponse":{"statusCode":"1","message":"Success","gatewayReference":"2143994610","gatewaySettlement":"2015-03-16","gatewayMessage":"Success","status":"AUTHORISED"},"route":"MCPE"},"transaction":{"transactionId":"10044236208","status":"SUCCESS","type":"REFUND","amount":4.89,"currency":"GBP","transactionTime":"2015-03-16T11:52:31.714Z","receivedTime":"2015-03-16T11:52:31.714Z","relatedTransaction":{"transactionId":"10044236139","merchantRef":"xyz-1234"}},"outcome":{"status":"SUCCESS","reasonCode":"S100","reasonMessage":"Authorised"},"trace":"Tp5PlxA6TF_FvBpD7HhFrfA","link":[{"rel":"transaction","href":"https://api.mite.paypoint.net:2443/acceptor/rest/transactions/5300014/10044236208"},{"rel":"related-transaction","href":"https://api.mite.paypoint.net:2443/acceptor/rest/transactions/5300014/10044236139"}]}
